batisteo.vscode-django
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
GustavoASC.google-drive-vscode
jebbs.plantuml
KevinRose.vsc-python-indent
MS-CEINTL.vscode-language-pack-ko
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
mushan.vscode-paste-image
nhatvu148.jupiter
njpwerner.autodocstring
starkwang.markdown
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
wholroyd.jinja
yzhang.markdown-all-in-one
