#주석
# 파이썬에서는 #을 붙여서 나타냄
# vscode 단축키 ctrl+/ (주석 단축키) or 말머리에 #을 사용

print("1+2=",1+2)#1+2의 결과를 출력
print("1-2=",1-2)#1-2의 결과를 출력
print("1*2=",1*2)#1*2의 결과를 출력
print("1/2=",1/2)#1/2의 결과를 출력
print("2**3=",2**3)
print("3/2=",3/2)
print("3//2=",3//2)
print("3%2=",3%2)

# Python의 연산자
# +　더하기 연산자
# -　빼기 연산자
# *　곱하기 연산자
# /　나누기 연산자
# ** 제곱 연산자
# // 정수 나누기 (몫) 연산자
# %　나머지 연산자

print("안녕")
print('반가워')
print("여러분")
print("그는 생각했다. '이런저런'")
print('그녀는 말했다. "하하하"')
print("쌍따옴표 사용하기 \"사용하기\"")
# 이스케이프 문자 (\ 역슬래시 사용)
# \n 줄바꿈
# \r 리턴
# \t 탭
# \" 쌍따옴표
# \' 따옴표
print("줄바꿈n\n\t탭t")
print("""안녕하세요
반갑습니다
잘부탁드립니다
안녕히계세요""")
print('''ㅇㅇㅇㅇ
ㅁㅁㅁㅁ
ㄹㄹㄹㄹ
ㅎㅎㅎㅎ''')
-print ("\"하이\"")
-print ("하이")